2023-01/drlfoam/ahmedBody2D_dns_with_actuator/ahmedBody2D_pimpleFoam/0.orig/include/frontBackUpperPatches
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

upperWall
{
    type symmetryPlane;
}

frontAndBack
{
    type empty;
}

// ************************************************************************* //
