2023-01/drlfoam/ahmedBody2D_dns_with_actuator/ahmedBody2D_pimpleFoam/0.orig/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity         (0.057 0 0);
jetVelocity         (0.25 0 0);
pressure             0;

// ************************************************************************* //
